src/cf/src/Catalogs/ИменаПользователей/ИменаПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИменаПользователей</name>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктуализацииAD</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторAD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательОС</name>
    <comment>Аутентификационная информация вида \\домен\учетная запись</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринадлежитКAD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяАктуализацияПользователя1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьWindows</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПраваПользователя</name>
    <attributes>
      <name>ШаблонДоступа</name>
      <type>
        <types>CatalogRef.ШаблоныДоступаПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Причина, номер запроса</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>CatalogRef.ГруппыПользователейAD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнформационныеБазыДляОбновленияПрав</name>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.СписокИнформационныхБаз1С</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьПрава</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ИменаПользователей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция ищет и создает элемент справочника (если не найден пользователь)
//
// Параметры:
//  ПараметрыЗаполнения	 - Структура:
//		* Email - Строка 
//		* Сотрудник - Строка - поиск по наименованию 
//		* Аккаунт - Строка - поиск по реквизиту УчетнаяЗаписьWindows 
//  ТолькоПоиск			 - Булево 
// 
// Возвращаемое значение:
//   СправочникСсылка.ИменаПользователей
//
Функция НайтиСоздатьИмяПользователя(ПараметрыЗаполнения, ТолькоПоиск = Ложь) Экспорт
	
	Результат = Справочники.ИменаПользователей.ПустаяСсылка();
	
	Если ПараметрыЗаполнения.Свойство("Email") Тогда
		Результат = Справочники.ИменаПользователей.НайтиПоРеквизиту("Email",ПараметрыЗаполнения.Email);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Результат)
		И ПараметрыЗаполнения.Свойство("Сотрудник") Тогда
		Результат = Справочники.ИменаПользователей.НайтиПоНаименованию(ПараметрыЗаполнения.Сотрудник,Истина);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Результат)
		И ПараметрыЗаполнения.Свойство("Аккаунт") Тогда
		Результат = Справочники.ИменаПользователей.НайтиПоРеквизиту("УчетнаяЗаписьWindows",ПараметрыЗаполнения.Аккаунт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат)
		Или ТолькоПоиск Тогда
		Возврат Результат;
	КонецЕсли;
	
	// создаем новый элемент справочника
	ОбъектИменаПользователей = Справочники.ИменаПользователей.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектИменаПользователей,ПараметрыЗаполнения);	
	ОбъектИменаПользователей.Записать();
	
	Результат = ОбъектИменаПользователей.Ссылка;
	
	Возврат Результат;
	
КонецФункции // НайтиСоздатьИмяПользователя()

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Добавить или обновить базу для обновления прав пользователя
//
// Параметры:
//  ОбъектИменаПользователей - СправочникОбъект.ИменаПользователей - объект для обновления
//  ИнформационнаяБаза		 - СправочникСсылка.СписокИнформационныхБаз1С - база для обновления прав
//
Процедура ДобавитьБазуДляОбновленияПрав(ОбъектИменаПользователей, ИнформационнаяБаза) Экспорт
	
	СтрокаТабличнойЧасти = ОбъектИменаПользователей.ИнформационныеБазыДляОбновленияПрав.Найти(ИнформационнаяБаза, "ИнформационнаяБаза");
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = ОбъектИменаПользователей.ИнформационныеБазыДляОбновленияПрав.Добавить();
		СтрокаТабличнойЧасти.ИнформационнаяБаза = ИнформационнаяБаза;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.ОбновитьПрава = Истина;

КонецПроцедуры 

#КонецОбласти

#КонецЕсли
